<!DOCTYPE html>


<html>

	<head>

	</head>

	
	<body>
		<h1>CONHE&Ccedil;A ADA LOVELACE, PRIMEIRA PROGRAMADORA DA HIST&Oacute;RIA </h1>
        <br/>  
            
            <p>Voc&ecirc; j&aacute; ouviu falar em <strong>Ada Lovelace?</strong> Essa condessa da imagem, retratada em pintura feita por Alfred Edward Chalon em 1840, &eacute; considerada a <strong>primeira programadora da hist&oacute;ria</strong>!</p>
            
            <p>Hoje, dia 10 de outubro, &eacute; considerado o <strong>Dia de Ada Lovelace</strong>. A data &eacute; celebrada desde 2009, sempre na segunda ter&ccedil;a-feira do m&ecirc;s de outubro. &Eacute; uma <strong>celebra&ccedil;&atilde;o das conquistas femininas em &aacute;reas que at&eacute; hoje s&atilde;o dominadas por homens</strong>, como ci&ecirc;ncia, tecnologia, engenharia e matem&aacute;tica.</p>
            
            <p>O evento foi criado pela brit&acirc;nica Suw Charmam-Anderson, que &eacute; tecn&oacute;loga social, escritora e jornalista, e re&uacute;ne acontecimentos em todo o mundo.</p> 

        <h2>QUEM FOI ADA LOVELACE?</h2>
            
            <p>Em 1842, Ada se tornou a primeira pessoa a <strong>programar</strong> (como fazemos hoje com computadores), ao acrescentar algoritmos para funcionamento de uma m&aacute;quina mec&acirc;nica.</p>
            
            <p>Filha do poeta Lord Byron, a condessa de Lovelace era <strong>matem&aacute;tica</strong> e contribuiu com a tradu&ccedil;&atilde;o de um artigo cient&iacute;fico, acrescentando mais dados ao mesmo. A programadora nasceu em 10 de dezembro de 1815.</p> 
            
            <p>Incentivada pela m&atilde;e, <strong>Ada estudou matem&aacute;tica e l&oacute;gica</strong>. Ela colaborou profissionalmente com <strong>Charles Babbage</strong> no projeto <strong>M&aacute;quina Anal&iacute;tica</strong>, o <strong>primeiro computador mec&acirc;nico</strong>.</p>
        
        <h3><em>A Ada criava algoritmos para serem processadas pela m&aacute;quina, o que muitos consideram ser o primeiro software, ou o primeiro programa de computador. Ela escreveu v&aacute;rias notas sobre a m&aacute;quina anal&iacute;tica e refletia sobre como o indiv&iacute;duo e a sociedade se relacionam com a tecnologia de forma colaborativa.</em></h3>
            
            <p>Se hoje vivemos cercados de tecnologia por todos os lados, devemos um pouco a ela. Ada morreu muito jovem, aos 36 anos, mas estar&aacute; para sempre na nossa galeria de <strong>mulheres inspiradoras</strong>.</p>


</body>
</html>




